"""
Написать программу, сортирующую список словарей по значению некоторого общего ключа с помощью lambda-фунции
(Например, список сотрудников по их возрасту)
"""

person = ({"name": "Iryna", "age": 33}, {"name": "Maksym", "age": 36}, {"name": "Daryna", "age": 13})

print(person)
print(list(iter(person)))